TexasInstruments/mcupsdk-core/source/sdl/include/am263px/sdlr_param_regs.h
/*
 *
 *  Copyright (c) Texas Instruments Incorporated 2022-2023
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
 
#ifndef INCLUDE_SDL_PARAM_REGS_H_
#define INCLUDE_SDL_PARAM_REGS_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include <stdint.h>
#include <sdl/include/am263x/sdlr_soc_baseaddress.h>

/* PARAM Registers */
#define SDL_PARAM_REG_SET0							(0x52A04000U)
#define SDL_PARAM_REG_SET1							(0x52A04020U)
#define SDL_PARAM_REG_SET2							(0x52A04040U)
#define SDL_PARAM_REG_SET3							(0x52A04060U)
#define SDL_PARAM_REG_SET4							(0x52A04080U)
#define SDL_PARAM_REG_SET5							(0x52A040A0U)
#define SDL_PARAM_REG_SET6							(0x52A040C0U)
#define SDL_PARAM_REG_SET7							(0x52A040E0U)
#define SDL_PARAM_REG_SET8							(0x52A04100U)
#define SDL_PARAM_REG_SET9							(0x52A04120U)
#define SDL_PARAM_REG_SET10							(0x52A04140U)
#define SDL_PARAM_REG_SET11							(0x52A04160U)
#define SDL_PARAM_REG_SET12							(0x52A04180U)
#define SDL_PARAM_REG_SET13							(0x52A041A0U)
#define SDL_PARAM_REG_SET14							(0x52A041C0U)
#define SDL_PARAM_REG_SET15							(0x52A041E0U)

#define SDL_PARAM_REG_SET16							(0x52A04200U)
#define SDL_PARAM_REG_SET17							(0x52A04220U)
#define SDL_PARAM_REG_SET18							(0x52A04240U)
#define SDL_PARAM_REG_SET19							(0x52A04260U)
#define SDL_PARAM_REG_SET20							(0x52A04280U)
#define SDL_PARAM_REG_SET21							(0x52A042A0U)
#define SDL_PARAM_REG_SET22							(0x52A042C0U)
#define SDL_PARAM_REG_SET23							(0x52A042E0U)
#define SDL_PARAM_REG_SET24							(0x52A04300U)
#define SDL_PARAM_REG_SET25							(0x52A04320U)
#define SDL_PARAM_REG_SET26							(0x52A04340U)
#define SDL_PARAM_REG_SET27							(0x52A04360U)
#define SDL_PARAM_REG_SET28							(0x52A04380U)
#define SDL_PARAM_REG_SET29							(0x52A043A0U)
#define SDL_PARAM_REG_SET30							(0x52A043C0U)
#define SDL_PARAM_REG_SET31							(0x52A043E0U)

#define SDL_PARAM_REG_SET32							(0x52A04400U)
#define SDL_PARAM_REG_SET33							(0x52A04420U)
#define SDL_PARAM_REG_SET34							(0x52A04440U)
#define SDL_PARAM_REG_SET35							(0x52A04460U)
#define SDL_PARAM_REG_SET36							(0x52A04480U)
#define SDL_PARAM_REG_SET37							(0x52A044A0U)
#define SDL_PARAM_REG_SET38							(0x52A044C0U)
#define SDL_PARAM_REG_SET39							(0x52A044E0U)
#define SDL_PARAM_REG_SET40							(0x52A04500U)
#define SDL_PARAM_REG_SET41							(0x52A04520U)
#define SDL_PARAM_REG_SET42							(0x52A04540U)
#define SDL_PARAM_REG_SET43							(0x52A04560U)
#define SDL_PARAM_REG_SET44							(0x52A04580U)
#define SDL_PARAM_REG_SET45							(0x52A045A0U)
#define SDL_PARAM_REG_SET46							(0x52A045C0U)
#define SDL_PARAM_REG_SET47							(0x52A045E0U)

#define SDL_PARAM_REG_SET48							(0x52A04600U)
#define SDL_PARAM_REG_SET49							(0x52A04620U)
#define SDL_PARAM_REG_SET50							(0x52A04640U)
#define SDL_PARAM_REG_SET51							(0x52A04660U)
#define SDL_PARAM_REG_SET52							(0x52A04680U)
#define SDL_PARAM_REG_SET53							(0x52A046A0U)
#define SDL_PARAM_REG_SET54							(0x52A046C0U)
#define SDL_PARAM_REG_SET55							(0x52A046E0U)
#define SDL_PARAM_REG_SET56							(0x52A04700U)
#define SDL_PARAM_REG_SET57							(0x52A04720U)
#define SDL_PARAM_REG_SET58							(0x52A04740U)
#define SDL_PARAM_REG_SET59							(0x52A04760U)
#define SDL_PARAM_REG_SET60							(0x52A04780U)
#define SDL_PARAM_REG_SET61							(0x52A047A0U)
#define SDL_PARAM_REG_SET62							(0x52A047C0U)
#define SDL_PARAM_REG_SET63							(0x52A047E0U)

#define SDL_PARAM_REG_SET64							(0x52A04800U)
#define SDL_PARAM_REG_SET65							(0x52A04820U)
#define SDL_PARAM_REG_SET66							(0x52A04840U)
#define SDL_PARAM_REG_SET67							(0x52A04860U)
#define SDL_PARAM_REG_SET68							(0x52A04880U)
#define SDL_PARAM_REG_SET69							(0x52A048A0U)
#define SDL_PARAM_REG_SET70							(0x52A048C0U)
#define SDL_PARAM_REG_SET71							(0x52A048E0U)
#define SDL_PARAM_REG_SET72							(0x52A04900U)
#define SDL_PARAM_REG_SET73							(0x52A04920U)
#define SDL_PARAM_REG_SET74							(0x52A04940U)
#define SDL_PARAM_REG_SET75							(0x52A04960U)
#define SDL_PARAM_REG_SET76							(0x52A04980U)
#define SDL_PARAM_REG_SET77							(0x52A049A0U)
#define SDL_PARAM_REG_SET78							(0x52A049C0U)
#define SDL_PARAM_REG_SET79							(0x52A049E0U)

#define SDL_PARAM_REG_SET80							(0x52A04A00U)
#define SDL_PARAM_REG_SET81							(0x52A04A20U)
#define SDL_PARAM_REG_SET82							(0x52A04A40U)
#define SDL_PARAM_REG_SET83							(0x52A04A60U)
#define SDL_PARAM_REG_SET84							(0x52A04A80U)
#define SDL_PARAM_REG_SET85							(0x52A04AA0U)
#define SDL_PARAM_REG_SET86							(0x52A04AC0U)
#define SDL_PARAM_REG_SET87							(0x52A04AE0U)
#define SDL_PARAM_REG_SET88							(0x52A04B00U)
#define SDL_PARAM_REG_SET89							(0x52A04B20U)
#define SDL_PARAM_REG_SET90							(0x52A04B40U)
#define SDL_PARAM_REG_SET91							(0x52A04B60U)
#define SDL_PARAM_REG_SET92							(0x52A04B80U)
#define SDL_PARAM_REG_SET93							(0x52A04BA0U)
#define SDL_PARAM_REG_SET94							(0x52A04BC0U)
#define SDL_PARAM_REG_SET95							(0x52A04BE0U)
#define SDL_PARAM_REG_SET96							(0x52A04C00U)

#define SDL_PARAM_REG_SET97							(0x52A04C20U)
#define SDL_PARAM_REG_SET98							(0x52A04C40U)
#define SDL_PARAM_REG_SET99							(0x52A04C60U)
#define SDL_PARAM_REG_SET100						(0x52A04C80U)
#define SDL_PARAM_REG_SET101						(0x52A04CA0U)
#define SDL_PARAM_REG_SET102						(0x52A04CC0U)
#define SDL_PARAM_REG_SET103						(0x52A04CE0U)
#define SDL_PARAM_REG_SET104						(0x52A04D00U)
#define SDL_PARAM_REG_SET105						(0x52A04D20U)
#define SDL_PARAM_REG_SET106						(0x52A04D40U)
#define SDL_PARAM_REG_SET107						(0x52A04D60U)
#define SDL_PARAM_REG_SET108						(0x52A04D80U)
#define SDL_PARAM_REG_SET109						(0x52A04DA0U)
#define SDL_PARAM_REG_SET110						(0x52A04DC0U)
#define SDL_PARAM_REG_SET111						(0x52A04DE0U)
#define SDL_PARAM_REG_SET112						(0x52A04E00U)

#define SDL_PARAM_REG_SET113						(0x52A04E20U)
#define SDL_PARAM_REG_SET114						(0x52A04E40U)
#define SDL_PARAM_REG_SET115						(0x52A04E60U)
#define SDL_PARAM_REG_SET116						(0x52A04E80U)
#define SDL_PARAM_REG_SET117						(0x52A04EA0U)
#define SDL_PARAM_REG_SET118						(0x52A04EC0U)
#define SDL_PARAM_REG_SET119						(0x52A04EE0U)
#define SDL_PARAM_REG_SET120						(0x52A04F00U)
#define SDL_PARAM_REG_SET121						(0x52A04F20U)
#define SDL_PARAM_REG_SET122						(0x52A04F40U)
#define SDL_PARAM_REG_SET123						(0x52A04F60U)
#define SDL_PARAM_REG_SET124						(0x52A04F80U)
#define SDL_PARAM_REG_SET125						(0x52A04FA0U)
#define SDL_PARAM_REG_SET126						(0x52A04FC0U)
#define SDL_PARAM_REG_SET127						(0x52A04FE0U)
#define SDL_PARAM_REG_SET128						(0x52A05000U)

#define SDL_PARAM_REG_SET129						(0x52A05020U)
#define SDL_PARAM_REG_SET130						(0x52A05040U)
#define SDL_PARAM_REG_SET131						(0x52A05060U)
#define SDL_PARAM_REG_SET132						(0x52A05080U)
#define SDL_PARAM_REG_SET133						(0x52A050A0U)
#define SDL_PARAM_REG_SET134						(0x52A050C0U)
#define SDL_PARAM_REG_SET135						(0x52A050E0U)
#define SDL_PARAM_REG_SET136						(0x52A05100U)
#define SDL_PARAM_REG_SET137						(0x52A05120U)
#define SDL_PARAM_REG_SET138						(0x52A05140U)
#define SDL_PARAM_REG_SET139						(0x52A05160U)
#define SDL_PARAM_REG_SET140						(0x52A05180U)
#define SDL_PARAM_REG_SET141						(0x52A051A0U)
#define SDL_PARAM_REG_SET142						(0x52A051C0U)
#define SDL_PARAM_REG_SET143						(0x52A051E0U)
#define SDL_PARAM_REG_SET144						(0x52A05200U)

#define SDL_PARAM_REG_SET145						(0x52A05220U)
#define SDL_PARAM_REG_SET146						(0x52A05240U)
#define SDL_PARAM_REG_SET147						(0x52A05260U)
#define SDL_PARAM_REG_SET148						(0x52A05280U)
#define SDL_PARAM_REG_SET149						(0x52A052A0U)
#define SDL_PARAM_REG_SET150						(0x52A052C0U)
#define SDL_PARAM_REG_SET151						(0x52A052E0U)
#define SDL_PARAM_REG_SET152						(0x52A05300U)
#define SDL_PARAM_REG_SET153						(0x52A05320U)
#define SDL_PARAM_REG_SET154						(0x52A05340U)
#define SDL_PARAM_REG_SET155						(0x52A05360U)
#define SDL_PARAM_REG_SET156						(0x52A05380U)
#define SDL_PARAM_REG_SET157						(0x52A053A0U)
#define SDL_PARAM_REG_SET158						(0x52A053C0U)
#define SDL_PARAM_REG_SET159						(0x52A053E0U)
#define SDL_PARAM_REG_SET160						(0x52A05400U)

#define SDL_PARAM_REG_SET161						(0x52A05420U)
#define SDL_PARAM_REG_SET162						(0x52A05440U)
#define SDL_PARAM_REG_SET163						(0x52A05460U)
#define SDL_PARAM_REG_SET164						(0x52A05480U)
#define SDL_PARAM_REG_SET165						(0x52A054A0U)
#define SDL_PARAM_REG_SET166						(0x52A054C0U)
#define SDL_PARAM_REG_SET167						(0x52A054E0U)
#define SDL_PARAM_REG_SET168						(0x52A05500U)
#define SDL_PARAM_REG_SET169						(0x52A05520U)
#define SDL_PARAM_REG_SET170						(0x52A05540U)
#define SDL_PARAM_REG_SET171						(0x52A05560U)
#define SDL_PARAM_REG_SET172						(0x52A05580U)
#define SDL_PARAM_REG_SET173						(0x52A055A0U)
#define SDL_PARAM_REG_SET174						(0x52A055C0U)
#define SDL_PARAM_REG_SET175						(0x52A055E0U)
#define SDL_PARAM_REG_SET176						(0x52A05600U)

#define SDL_PARAM_REG_SET177						(0x52A05620U)
#define SDL_PARAM_REG_SET178						(0x52A05640U)
#define SDL_PARAM_REG_SET179						(0x52A05660U)
#define SDL_PARAM_REG_SET180						(0x52A05680U)
#define SDL_PARAM_REG_SET181						(0x52A056A0U)
#define SDL_PARAM_REG_SET182						(0x52A056C0U)
#define SDL_PARAM_REG_SET183						(0x52A056E0U)
#define SDL_PARAM_REG_SET184						(0x52A05700U)
#define SDL_PARAM_REG_SET185						(0x52A05720U)
#define SDL_PARAM_REG_SET186						(0x52A05740U)
#define SDL_PARAM_REG_SET187						(0x52A05760U)
#define SDL_PARAM_REG_SET188						(0x52A05780U)
#define SDL_PARAM_REG_SET189						(0x52A057A0U)
#define SDL_PARAM_REG_SET190						(0x52A057C0U)
#define SDL_PARAM_REG_SET191						(0x52A057E0U)
#define SDL_PARAM_REG_SET192						(0x52A05800U)

#define SDL_PARAM_REG_SET193						(0x52A05820U)
#define SDL_PARAM_REG_SET194						(0x52A05840U)
#define SDL_PARAM_REG_SET195						(0x52A05860U)
#define SDL_PARAM_REG_SET196						(0x52A05880U)
#define SDL_PARAM_REG_SET197						(0x52A058A0U)
#define SDL_PARAM_REG_SET198						(0x52A058C0U)
#define SDL_PARAM_REG_SET199						(0x52A058E0U)
#define SDL_PARAM_REG_SET200						(0x52A058F0U)
#define SDL_PARAM_REG_SET201						(0x52A05900U)
#define SDL_PARAM_REG_SET202						(0x52A05920U)
#define SDL_PARAM_REG_SET203						(0x52A05940U)
#define SDL_PARAM_REG_SET204						(0x52A05960U)
#define SDL_PARAM_REG_SET205						(0x52A05980U)
#define SDL_PARAM_REG_SET206						(0x52A059A0U)
#define SDL_PARAM_REG_SET207						(0x52A059C0U)
#define SDL_PARAM_REG_SET208						(0x52A059E0U)

#define SDL_PARAM_REG_SET209						(0x52A05A00U)
#define SDL_PARAM_REG_SET210						(0x52A05A20U)
#define SDL_PARAM_REG_SET211						(0x52A05A40U)
#define SDL_PARAM_REG_SET212						(0x52A05A60U)
#define SDL_PARAM_REG_SET213						(0x52A05A80U)
#define SDL_PARAM_REG_SET214						(0x52A05AA0U)
#define SDL_PARAM_REG_SET215						(0x52A05AC0U)
#define SDL_PARAM_REG_SET216						(0x52A05AE0U)
#define SDL_PARAM_REG_SET217						(0x52A05B00U)
#define SDL_PARAM_REG_SET218						(0x52A05B20U)
#define SDL_PARAM_REG_SET219						(0x52A05B40U)
#define SDL_PARAM_REG_SET220						(0x52A05B60U)
#define SDL_PARAM_REG_SET221						(0x52A05B80U)
#define SDL_PARAM_REG_SET222						(0x52A05BA0U)
#define SDL_PARAM_REG_SET223						(0x52A05BC0U)
#define SDL_PARAM_REG_SET224						(0x52A05BE0U)

#define SDL_PARAM_REG_SET225						(0x52A05C00U)
#define SDL_PARAM_REG_SET226						(0x52A05C20U)
#define SDL_PARAM_REG_SET227						(0x52A05C40U)
#define SDL_PARAM_REG_SET228						(0x52A05C60U)
#define SDL_PARAM_REG_SET229						(0x52A05C80U)
#define SDL_PARAM_REG_SET230						(0x52A05CA0U)
#define SDL_PARAM_REG_SET231						(0x52A05CC0U)
#define SDL_PARAM_REG_SET232						(0x52A05CE0U)
#define SDL_PARAM_REG_SET233						(0x52A05D00U)
#define SDL_PARAM_REG_SET234						(0x52A05D20U)
#define SDL_PARAM_REG_SET235						(0x52A05D40U)
#define SDL_PARAM_REG_SET236						(0x52A05D60U)
#define SDL_PARAM_REG_SET237						(0x52A05D80U)
#define SDL_PARAM_REG_SET238						(0x52A05DA0U)
#define SDL_PARAM_REG_SET239						(0x52A05DC0U)
#define SDL_PARAM_REG_SET240						(0x52A05DE0U)

#define SDL_PARAM_REG_SET241						(0x52A05E00U)
#define SDL_PARAM_REG_SET242						(0x52A05E20U)
#define SDL_PARAM_REG_SET243						(0x52A05E40U)
#define SDL_PARAM_REG_SET244						(0x52A05E60U)
#define SDL_PARAM_REG_SET245						(0x52A05E80U)
#define SDL_PARAM_REG_SET246						(0x52A05EA0U)
#define SDL_PARAM_REG_SET247						(0x52A05EC0U)
#define SDL_PARAM_REG_SET248						(0x52A05EE0U)
#define SDL_PARAM_REG_SET249						(0x52A05F00U)
#define SDL_PARAM_REG_SET250						(0x52A05F20U)
#define SDL_PARAM_REG_SET251						(0x52A05F40U)
#define SDL_PARAM_REG_SET252						(0x52A05F60U)
#define SDL_PARAM_REG_SET253						(0x52A05F80U)
#define SDL_PARAM_REG_SET254						(0x52A05FA0U)
#define SDL_PARAM_REG_SET255						(0x52A05FC0U)
#define SDL_PARAM_REG_SET256						(0x52A05FE0U)

#ifdef __cplusplus
}
#endif
#endif
